#!usr/bih/env python3

trans_table={
    "а":"a"  , "А":"A"  ,
    "Б":"B" ,  "б":	 'b',
    "В":"V" ,  "в":	 'v',
    'Г':'G' ,  'г':	 'g',
    'Д':'D' ,  'д':	 'd',
    'Е':'E',   'е':	 'e',
    'Ж':'ZH',  'ж':	 'zh',
    'З':'Z',   'з':  'z',
    'И': 'I' , 'и':	'i',
    'Й': 'Y' , 'й':	'y',
    'К': 'K' , 'к':	'k',
    'Л': 'L' ,'л':	'l',
    'М': 'M' ,'м':	'm',
    'Н': 'N' ,'н':	'n',
    'О': 'O' ,'о':	'o',
    'П': 'P','п':	'p',
    'Р': 'R' ,'р':	'r',
    'С': 'S' ,'с':	's',
    'Т': 'T' ,'т':	't',
    'У': 'U' ,'у':	'u',
    'Ф': 'F' ,'ф':	'f',
    'Х': 'Kh' ,'х':	'kh',
    'Ц': 'Ts' ,'ц':	'ts',
    'Ч': 'Ch' ,'ч':	'ch',
    'Ш': 'Sh' ,'ш':	'sh',
    'Щ': 'Shch' ,'щ': 'shch',
    'ъ': '"',
    'Ы':'I',	'ы':'i',
    'ь': "'",
    'Э': 'E' ,  'э':'e'  ,
    'Ю': 'Yu' , 'ю':'yu',
    'Я': 'Ya',  'я':'ya'
    }

def translit_str(sarg):
    result=''
    for l in sarg:
        rl=trans_table.get(l)
        result+=l if rl is None else rl
    return result

